---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ExternalDataInstanceRemovingFromDocumentEventArgs Properties
ExternalDataInstanceRemovingFromDocumentEventArgs Class See Also Send Feedback
---

The ExternalDataInstanceRemovingFromDocumentEventArgs type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate.  (Inherited from RevitAPIEventArgs.) |
|  | Document | The document associated with the event.  (Inherited from RevitAPIPreDocEventArgs.) |
|  | InstanceId | The Revit id of the external data instance being removed from Revit document. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RevitAPIEventArgs.) |
|  | TypeId | The type id of the external data instance id being removed from Revit document. |

# See Also

ExternalDataInstanceRemovingFromDocumentEventArgs Class

Autodesk.Revit.DB.Events Namespace